Autodesk.Navisworks.Api.Plugins.AddInPluginRecord
Represents an AddInPlugin record in Navisworks

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.CanExecute
This is called to determine the state of plugin.
Primarily if Execute can be called.

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.CanToggle
Specifies if the command can toggle

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.Execute(System.String[])
Executes the plugin, loading it if needed
Throws Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException:
Execute is Disabled via CanExecute

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.Icon
The 16x16 icon to be displayed for this command

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.LargeIcon
The 32x32 icon to be displayed for this command

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.Location
Where the plugin is displayed in Navisworks menus system

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.Shortcut
Specifies the keyboard shortcut for the command.

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.ShortcutWindowTypes
The Ids of the windows for which the shortcut is valid.
Multiple Ids can be specified by separating with ";".
If Ids are specified the shortcut should be valid in all contexts.

Autodesk.Navisworks.Api.Plugins.AddInPluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load